testit.yml
---
scenarios:
  testit-jmx:
    script: testit.jmx

execution:
- scenario: testit-jmx
  concurrency: 20
  ramp-up: 30s

reporting:  # https://github.com/Blazemeter/taurus/blob/master/site/dat/docs/Reporting.md
- module: blazemeter
- module: final-stats
  dump-csv: testit-stats.csv
- module: console
- module: junit-xml

modules:
  jmeter:
    gui: true
    detect-plugins: true